TheZeroHz/ESP32CSI_Vision/src/cv/ESP32P4_Cv.cpp
#include "cv/ESP32P4_Cv.h"

#include "mem/ESP32P4_Psram.h"
#include "ppa/ESP32P4_Ppa.h"

#include <stdlib.h>
#include <string.h>

static void clampRoi(int w, int h, const esp32p4_rect_t *roi, int &x0, int &y0, int &x1, int &y1) {
  if (roi) {
    x0 = roi->x;
    y0 = roi->y;
    x1 = roi->x + roi->w;
    y1 = roi->y + roi->h;
  } else {
    x0 = 0;
    y0 = 0;
    x1 = w;
    y1 = h;
  }
  if (x0 < 0) x0 = 0;
  if (y0 < 0) y0 = 0;
  if (x1 > w) x1 = w;
  if (y1 > h) y1 = h;
}

static void toGraySw(const uint16_t *src, size_t n, uint8_t *dst) {
  size_t i = 0;
  for (; i + 4 <= n; i += 4) {
    dst[i] = ESP32P4_Img::luma565(src[i]);
    dst[i + 1] = ESP32P4_Img::luma565(src[i + 1]);
    dst[i + 2] = ESP32P4_Img::luma565(src[i + 2]);
    dst[i + 3] = ESP32P4_Img::luma565(src[i + 3]);
  }
  for (; i < n; i++) dst[i] = ESP32P4_Img::luma565(src[i]);
}

bool ESP32P4_Cv::toGray(const uint16_t *src, int w, int h, uint8_t *dst, const esp32p4_rect_t *roi) {
  if (!src || !dst || w <= 0 || h <= 0) return false;
  if (!roi) {
    if (ESP32P4_Ppa::cv().rgb565ToGray(src, w, h, dst)) return true;
    toGraySw(src, (size_t)w * (size_t)h, dst);
    return true;
  }
  int x0, y0, x1, y1;
  clampRoi(w, h, roi, x0, y0, x1, y1);
  int dw = x1 - x0, dh = y1 - y0;
  for (int y = 0; y < dh; y++) {
    const uint16_t *row = src + (y0 + y) * w + x0;
    uint8_t *drow = dst + y * dw;
    for (int x = 0; x < dw; x++) drow[x] = ESP32P4_Img::luma565(row[x]);
  }
  return true;
}

bool ESP32P4_Cv::downsample2x(const uint8_t *src, int sw, int sh, uint8_t *dst) {
  if (!src || !dst || sw < 2 || sh < 2) return false;
  int dw = sw / 2, dh = sh / 2;
  for (int y = 0; y < dh; y++) {
    const uint8_t *row = src + (y * 2) * sw;
    uint8_t *drow = dst + y * dw;
    for (int x = 0; x < dw; x++) drow[x] = row[x * 2];
  }
  return true;
}

bool ESP32P4_Cv::toGrayScale(const uint16_t *src, int sw, int sh, uint8_t *dst, int dw, int dh) {
  if (!src || !dst || sw <= 0 || sh <= 0 || dw <= 0 || dh <= 0) return false;
  if (ESP32P4_Ppa::cv().rgb565ToGrayScale(src, sw, sh, dst, dw, dh)) return true;
  // SW fallback: full gray then nearest scale
  uint8_t *full = (uint8_t *)esp32p4_psram_alloc((size_t)sw * (size_t)sh);
  if (!full) return false;
  toGraySw(src, (size_t)sw * (size_t)sh, full);
  for (int y = 0; y < dh; y++) {
    int sy = y * sh / dh;
    const uint8_t *row = full + sy * sw;
    uint8_t *drow = dst + y * dw;
    for (int x = 0; x < dw; x++) drow[x] = row[x * sw / dw];
  }
  esp32p4_psram_free(full);
  return true;
}

/** Separable 3×3 box blur — ~3× fewer ops than 3×3 nested loops (esp32-opencv style). */
bool ESP32P4_Cv::blur3x3(const uint8_t *src, int w, int h, uint8_t *dst, const esp32p4_rect_t *roi) {
  if (!src || !dst || w < 3 || h < 3) return false;
  if (roi) {
    // ROI path: keep simple full-kernel (rare in dashboard)
    int x0, y0, x1, y1;
    clampRoi(w, h, roi, x0, y0, x1, y1);
    const int dw = x1 - x0, dh = y1 - y0;
    uint8_t *tmp = (uint8_t *)esp32p4_psram_alloc((size_t)dw * (size_t)dh);
    if (!tmp) return false;
    for (int y = 0; y < dh; y++) memcpy(tmp + y * dw, src + (y0 + y) * w + x0, (size_t)dw);
    bool ok = blur3x3(tmp, dw, dh, dst, nullptr);
    esp32p4_psram_free(tmp);
    return ok;
  }

  static uint8_t *rowbuf = nullptr;
  static int rowbuf_w = 0;
  if (rowbuf_w < w) {
    esp32p4_psram_free(rowbuf);
    rowbuf = (uint8_t *)esp32p4_psram_alloc((size_t)w * 3);
    rowbuf_w = rowbuf ? w : 0;
    if (!rowbuf) return false;
  }

  // Horizontal pass into dst, then vertical in-place using 3-row ring.
  for (int y = 0; y < h; y++) {
    const uint8_t *s = src + y * w;
    uint8_t *d = dst + y * w;
    d[0] = (uint8_t)(((uint32_t)s[0] + s[0] + s[1]) / 3);
    for (int x = 1; x < w - 1; x++)
      d[x] = (uint8_t)(((uint32_t)s[x - 1] + s[x] + s[x + 1]) / 3);
    d[w - 1] = (uint8_t)(((uint32_t)s[w - 2] + s[w - 1] + s[w - 1]) / 3);
  }

  uint8_t *r0 = rowbuf;
  uint8_t *r1 = rowbuf + w;
  uint8_t *r2 = rowbuf + 2 * w;
  memcpy(r0, dst, (size_t)w);
  memcpy(r1, dst, (size_t)w);
  for (int y = 0; y < h; y++) {
    if (y + 1 < h) memcpy(r2, dst + (y + 1) * w, (size_t)w);
    else memcpy(r2, r1, (size_t)w);
    uint8_t *d = dst + y * w;
    for (int x = 0; x < w; x++)
      d[x] = (uint8_t)(((uint32_t)r0[x] + r1[x] + r2[x]) / 3);
    uint8_t *t = r0;
    r0 = r1;
    r1 = r2;
    r2 = t;
  }
  return true;
}

bool ESP32P4_Cv::threshold(const uint8_t *src, int w, int h, uint8_t *dst, uint8_t thr,
                           esp32p4_thresh_t type, const esp32p4_rect_t *roi) {
  if (!src || !dst || w <= 0 || h <= 0) return false;
  int x0, y0, x1, y1;
  clampRoi(w, h, roi, x0, y0, x1, y1);
  const bool cropped = roi != nullptr;
  const int dw = cropped ? (x1 - x0) : w;
  const int dh = cropped ? (y1 - y0) : h;
  for (int y = 0; y < dh; y++) {
    const uint8_t *row = cropped ? (src + (y0 + y) * w + x0) : (src + y * w);
    uint8_t *drow = cropped ? (dst + y * dw) : (dst + y * w);
    for (int x = 0; x < dw; x++) {
      bool on = row[x] > thr;
      if (type == ESP32P4_THRESH_BINARY_INV) on = !on;
      drow[x] = on ? 255 : 0;
    }
  }
  return true;
}

uint8_t ESP32P4_Cv::otsu(const uint8_t *gray, size_t pixels) {
  if (!gray || !pixels) return 128;
  uint32_t hist[256];
  memset(hist, 0, sizeof(hist));
  for (size_t i = 0; i < pixels; i++) hist[gray[i]]++;

  double total = (double)pixels;
  double sum = 0;
  for (int i = 0; i < 256; i++) sum += (double)i * hist[i];

  double sum_b = 0;
  double w_b = 0;
  double max_var = -1;
  int best = 128;
  for (int t = 0; t < 256; t++) {
    w_b += hist[t];
    if (w_b <= 0) continue;
    double w_f = total - w_b;
    if (w_f <= 0) break;
    sum_b += (double)t * hist[t];
    double m_b = sum_b / w_b;
    double m_f = (sum - sum_b) / w_f;
    double diff = m_b - m_f;
    double var = w_b * w_f * diff * diff;
    if (var > max_var) {
      max_var = var;
      best = t;
    }
  }
  return (uint8_t)best;
}

bool ESP32P4_Cv::adaptiveThreshold(const uint8_t *src, int w, int h, uint8_t *dst, int block_size,
                                   int C, bool dark, uint32_t *integral_scratch) {
  if (!src || !dst || w <= 0 || h <= 0) return false;
  if (block_size < 3) block_size = 3;
  if ((block_size & 1) == 0) block_size++;
  const int r = block_size / 2;

  const size_t isize = (size_t)(w + 1) * (size_t)(h + 1);
  bool own = false;
  uint32_t *ii = integral_scratch;
  if (!ii) {
    ii = (uint32_t *)esp32p4_psram_alloc(isize * sizeof(uint32_t));
    if (!ii) return false;
    own = true;
  }
  memset(ii, 0, isize * sizeof(uint32_t));
  for (int y = 0; y < h; y++) {
    uint32_t row = 0;
    for (int x = 0; x < w; x++) {
      row += src[y * w + x];
      ii[(y + 1) * (w + 1) + (x + 1)] = ii[y * (w + 1) + (x + 1)] + row;
    }
  }

