TheZeroHz/ESP32CSI_Vision/src/cv/ESP32P4_Cv.cpp
  auto rectSum = [&](int x0, int y0, int x1, int y1) -> uint32_t {
    // inclusive coords clamped
    if (x0 < 0) x0 = 0;
    if (y0 < 0) y0 = 0;
    if (x1 >= w) x1 = w - 1;
    if (y1 >= h) y1 = h - 1;
    if (x1 < x0 || y1 < y0) return 0;
    const int A = y0 * (w + 1) + x0;
    const int B = y0 * (w + 1) + (x1 + 1);
    const int Cc = (y1 + 1) * (w + 1) + x0;
    const int D = (y1 + 1) * (w + 1) + (x1 + 1);
    return ii[D] - ii[B] - ii[Cc] + ii[A];
  };

  for (int y = 0; y < h; y++) {
    for (int x = 0; x < w; x++) {
      int x0 = x - r, y0 = y - r, x1 = x + r, y1 = y + r;
      int bw = (x1 < w ? x1 : w - 1) - (x0 > 0 ? x0 : 0) + 1;
      int bh = (y1 < h ? y1 : h - 1) - (y0 > 0 ? y0 : 0) + 1;
      uint32_t sum = rectSum(x0, y0, x1, y1);
      int mean = (int)(sum / (uint32_t)(bw * bh));
      int pix = src[y * w + x];
      bool on = dark ? (pix < mean - C) : (pix > mean + C);
      dst[y * w + x] = on ? 255 : 0;
    }
  }
  if (own) esp32p4_psram_free(ii);
  return true;
}

bool ESP32P4_Cv::morphologyOpen(const uint8_t *src, int w, int h, uint8_t *dst, int iterations) {
  if (!src || !dst || iterations < 1) return false;
  static uint8_t *tmp = nullptr;
  static size_t cap = 0;
  size_t n = (size_t)w * (size_t)h;
  if (cap < n) {
    esp32p4_psram_free(tmp);
    tmp = (uint8_t *)esp32p4_psram_alloc(n);
    cap = tmp ? n : 0;
    if (!tmp) return false;
  }
  return erode(src, w, h, tmp, iterations) && dilate(tmp, w, h, dst, iterations);
}

bool ESP32P4_Cv::morphologyClose(const uint8_t *src, int w, int h, uint8_t *dst, int iterations) {
  if (!src || !dst || iterations < 1) return false;
  static uint8_t *tmp = nullptr;
  static size_t cap = 0;
  size_t n = (size_t)w * (size_t)h;
  if (cap < n) {
    esp32p4_psram_free(tmp);
    tmp = (uint8_t *)esp32p4_psram_alloc(n);
    cap = tmp ? n : 0;
    if (!tmp) return false;
  }
  return dilate(src, w, h, tmp, iterations) && erode(tmp, w, h, dst, iterations);
}

esp32p4_hsv_t ESP32P4_Cv::rgb565ToHsv(uint16_t px) {
  int r = ((px >> 11) & 0x1F) * 255 / 31;
  int g = ((px >> 5) & 0x3F) * 255 / 63;
  int b = (px & 0x1F) * 255 / 31;
  int mx = r > g ? (r > b ? r : b) : (g > b ? g : b);
  int mn = r < g ? (r < b ? r : b) : (g < b ? g : b);
  int v = mx;
  int delta = mx - mn;
  int s = (mx == 0) ? 0 : (delta * 255 / mx);
  int h = 0;
  if (delta != 0) {
    if (mx == r) h = (60 * (g - b) / delta + 360) % 360;
    else if (mx == g) h = 60 * (b - r) / delta + 120;
    else h = 60 * (r - g) / delta + 240;
  }
  esp32p4_hsv_t o;
  o.h = (uint8_t)(h / 2);  // 0..179
  o.s = (uint8_t)s;
  o.v = (uint8_t)v;
  return o;
}

static bool hsvInRange(esp32p4_hsv_t v, esp32p4_hsv_t lo, esp32p4_hsv_t hi) {
  if (v.s < lo.s || v.s > hi.s || v.v < lo.v || v.v > hi.v) return false;
  if (lo.h <= hi.h) return v.h >= lo.h && v.h <= hi.h;
  return v.h >= lo.h || v.h <= hi.h;  // wrap
}

bool ESP32P4_Cv::inRangeHsv(const uint16_t *src, int w, int h, uint8_t *dst, esp32p4_hsv_t lo,
                            esp32p4_hsv_t hi, const esp32p4_rect_t *roi) {
  if (!src || !dst || w <= 0 || h <= 0) return false;
  int x0, y0, x1, y1;
  clampRoi(w, h, roi, x0, y0, x1, y1);
  const bool cropped = roi != nullptr;
  const int dw = cropped ? (x1 - x0) : w;
  const int dh = cropped ? (y1 - y0) : h;
  for (int y = 0; y < dh; y++) {
    const uint16_t *row = cropped ? (src + (y0 + y) * w + x0) : (src + y * w);
    uint8_t *drow = cropped ? (dst + y * dw) : (dst + y * w);
    for (int x = 0; x < dw; x++) drow[x] = hsvInRange(rgb565ToHsv(row[x]), lo, hi) ? 255 : 0;
  }
  return true;
}

static bool morphEnsure(size_t n, uint8_t **a, uint8_t **b) {
  static uint8_t *sa = nullptr, *sb = nullptr;
  static size_t cap = 0;
  if (cap < n) {
    esp32p4_psram_free(sa);
    esp32p4_psram_free(sb);
    sa = (uint8_t *)esp32p4_psram_alloc(n);
    sb = (uint8_t *)esp32p4_psram_alloc(n);
    cap = (sa && sb) ? n : 0;
    if (!cap) {
      esp32p4_psram_free(sa);
      esp32p4_psram_free(sb);
      sa = sb = nullptr;
      return false;
    }
  }
  *a = sa;
  *b = sb;
  return true;
}

static bool morphOp(const uint8_t *src, int w, int h, uint8_t *dst, bool dilate_op, int iterations,
                    const esp32p4_rect_t *roi) {
  if (!src || !dst || w < 3 || h < 3 || iterations < 1) return false;
  int x0, y0, x1, y1;
  clampRoi(w, h, roi, x0, y0, x1, y1);
  const bool cropped = roi != nullptr;
  const int dw = cropped ? (x1 - x0) : w;
  const int dh = cropped ? (y1 - y0) : h;
  const size_t n = (size_t)dw * (size_t)dh;

  uint8_t *a = nullptr, *b = nullptr;
  if (!morphEnsure(n, &a, &b)) return false;
  if (cropped) {
    for (int y = 0; y < dh; y++) memcpy(a + y * dw, src + (y0 + y) * w + x0, (size_t)dw);
  } else {
    memcpy(a, src, n);
  }

  uint8_t *cur = a;
  uint8_t *nxt = b;
  for (int it = 0; it < iterations; it++) {
    // Interior: no clamps (OpenCV-style speed path)
    for (int y = 1; y < dh - 1; y++) {
      const uint8_t *r0 = cur + (y - 1) * dw;
      const uint8_t *r1 = cur + y * dw;
      const uint8_t *r2 = cur + (y + 1) * dw;
      uint8_t *d = nxt + y * dw;
      for (int x = 1; x < dw - 1; x++) {
        if (dilate_op) {
          uint8_t m = r0[x - 1] | r0[x] | r0[x + 1] | r1[x - 1] | r1[x] | r1[x + 1] | r2[x - 1] |
                      r2[x] | r2[x + 1];
          d[x] = m ? 255 : 0;
        } else {
          uint8_t m = r0[x - 1] & r0[x] & r0[x + 1] & r1[x - 1] & r1[x] & r1[x + 1] & r2[x - 1] &
                      r2[x] & r2[x + 1];
          d[x] = m ? 255 : 0;
        }
      }
      // left/right border of row
      d[0] = dilate_op ? (r1[0] | r1[1] ? 255 : 0) : (r1[0] & r1[1] ? 255 : 0);
      d[dw - 1] = dilate_op ? (r1[dw - 2] | r1[dw - 1] ? 255 : 0)
                            : (r1[dw - 2] & r1[dw - 1] ? 255 : 0);
    }
    // top/bottom rows (copy nearest interior treatment simply)
    memcpy(nxt, nxt + dw, (size_t)dw);
    memcpy(nxt + (dh - 1) * dw, nxt + (dh - 2) * dw, (size_t)dw);
    uint8_t *t = cur;
    cur = nxt;
    nxt = t;
  }
  memcpy(dst, cur, n);
  return true;
}

bool ESP32P4_Cv::erode(const uint8_t *src, int w, int h, uint8_t *dst, int iterations,
                       const esp32p4_rect_t *roi) {
  return morphOp(src, w, h, dst, false, iterations, roi);
}

