TheZeroHz/ESP32CSI_Vision/src/cv/ESP32P4_Cv.cpp
bool ESP32P4_Cv::dilate(const uint8_t *src, int w, int h, uint8_t *dst, int iterations,
                        const esp32p4_rect_t *roi) {
  return morphOp(src, w, h, dst, true, iterations, roi);
}

bool ESP32P4_Cv::edges(const uint8_t *src, int w, int h, uint8_t *dst, uint8_t thr_lo,
                       uint8_t thr_hi, uint16_t *mag_scratch, const esp32p4_rect_t *roi) {
  if (!src || !dst || w < 3 || h < 3) return false;
  if (roi) {
    // Rare path — keep compatible
    int x0, y0, x1, y1;
    clampRoi(w, h, roi, x0, y0, x1, y1);
    const int dw = x1 - x0, dh = y1 - y0;
    uint16_t *mag = mag_scratch;
    bool own = false;
    if (!mag) {
      mag = (uint16_t *)esp32p4_psram_alloc((size_t)dw * (size_t)dh * sizeof(uint16_t));
      if (!mag) return false;
      own = true;
    }
    for (int y = 0; y < dh; y++) {
      for (int x = 0; x < dw; x++) {
        auto gAt = [&](int xx, int yy) -> int {
          if (xx < 0) xx = 0;
          if (yy < 0) yy = 0;
          if (xx >= dw) xx = dw - 1;
          if (yy >= dh) yy = dh - 1;
          return src[(y0 + yy) * w + (x0 + xx)];
        };
        int gx = -gAt(x - 1, y - 1) - 2 * gAt(x - 1, y) - gAt(x - 1, y + 1) + gAt(x + 1, y - 1) +
                 2 * gAt(x + 1, y) + gAt(x + 1, y + 1);
        int gy = -gAt(x - 1, y - 1) - 2 * gAt(x, y - 1) - gAt(x + 1, y - 1) + gAt(x - 1, y + 1) +
                 2 * gAt(x, y + 1) + gAt(x + 1, y + 1);
        if (gx < 0) gx = -gx;
        if (gy < 0) gy = -gy;
        uint32_t m = (uint32_t)gx + (uint32_t)gy;
        if (m > 65535) m = 65535;
        mag[y * dw + x] = (uint16_t)m;
      }
    }
    for (int y = 0; y < dh; y++) {
      uint8_t *drow = dst + y * dw;
      for (int x = 0; x < dw; x++) {
        uint16_t m = mag[y * dw + x];
        drow[x] = (m >= thr_hi) ? 255 : (m >= thr_lo ? 128 : 0);
      }
    }
    if (own) esp32p4_psram_free(mag);
    return true;
  }

  uint16_t *mag = mag_scratch;
  bool own = false;
  if (!mag) {
    mag = (uint16_t *)esp32p4_psram_alloc((size_t)w * (size_t)h * sizeof(uint16_t));
    if (!mag) return false;
    own = true;
  }

  // Fast Sobel on interior with row pointers (no per-pixel clamps).
  memset(mag, 0, (size_t)w * sizeof(uint16_t));
  memset(mag + (h - 1) * w, 0, (size_t)w * sizeof(uint16_t));
  for (int y = 1; y < h - 1; y++) {
    const uint8_t *r0 = src + (y - 1) * w;
    const uint8_t *r1 = src + y * w;
    const uint8_t *r2 = src + (y + 1) * w;
    uint16_t *mrow = mag + y * w;
    mrow[0] = 0;
    mrow[w - 1] = 0;
    for (int x = 1; x < w - 1; x++) {
      int gx = -r0[x - 1] - 2 * r1[x - 1] - r2[x - 1] + r0[x + 1] + 2 * r1[x + 1] + r2[x + 1];
      int gy = -r0[x - 1] - 2 * r0[x] - r0[x + 1] + r2[x - 1] + 2 * r2[x] + r2[x + 1];
      if (gx < 0) gx = -gx;
      if (gy < 0) gy = -gy;
      uint32_t m = (uint32_t)gx + (uint32_t)gy;
      if (m > 65535) m = 65535;
      mrow[x] = (uint16_t)m;
    }
  }

  for (int y = 0; y < h; y++) {
    uint8_t *drow = dst + y * w;
    const uint16_t *mrow = mag + y * w;
    for (int x = 0; x < w; x++) {
      uint16_t m = mrow[x];
      drow[x] = (m >= thr_hi) ? 255 : (m >= thr_lo ? 128 : 0);
    }
  }
  if (own) esp32p4_psram_free(mag);
  return true;
}

int ESP32P4_Cv::findBlobs(const uint8_t *bin, int w, int h, esp32p4_blob_t *out, int max_out,
                          int min_area, uint16_t *label_scratch, const esp32p4_rect_t *roi) {
  if (!bin || !out || !label_scratch || max_out <= 0 || w <= 0 || h <= 0) return 0;
  int x0, y0, x1, y1;
  clampRoi(w, h, roi, x0, y0, x1, y1);
  const bool cropped = roi != nullptr;
  const int dw = cropped ? (x1 - x0) : w;
  const int dh = cropped ? (y1 - y0) : h;
  memset(label_scratch, 0, (size_t)dw * (size_t)dh * sizeof(uint16_t));

  // Keep union-find / blob stats off the caller's stack (MJPEG worker ~12–16KB).
  const int MAX_LABELS = 256;
  struct BlobWork {
    uint16_t parent[256];
    int area[256];
    int minx[256], miny[256], maxx[256], maxy[256];
    int32_t sx[256], sy[256];
  };
  static BlobWork *bw = nullptr;
  if (!bw) {
    bw = (BlobWork *)esp32p4_psram_alloc(sizeof(BlobWork));
    if (!bw) return 0;
  }

  for (int i = 0; i < MAX_LABELS; i++) {
    bw->parent[i] = (uint16_t)i;
    bw->area[i] = 0;
    bw->minx[i] = dw;
    bw->miny[i] = dh;
    bw->maxx[i] = 0;
    bw->maxy[i] = 0;
    bw->sx[i] = 0;
    bw->sy[i] = 0;
  }

  auto find = [&](uint16_t a) -> uint16_t {
    while (bw->parent[a] != a) a = bw->parent[a] = bw->parent[bw->parent[a]];
    return a;
  };
  auto unite = [&](uint16_t a, uint16_t b) {
    a = find(a);
    b = find(b);
    if (a != b) bw->parent[b] = a;
  };

  uint16_t next = 1;
  auto pix = [&](int x, int y) -> uint8_t {
    return cropped ? bin[(y0 + y) * w + (x0 + x)] : bin[y * w + x];
  };

  for (int y = 0; y < dh; y++) {
    for (int x = 0; x < dw; x++) {
      if (!pix(x, y)) continue;
      uint16_t left = (x > 0) ? label_scratch[y * dw + (x - 1)] : 0;
      uint16_t up = (y > 0) ? label_scratch[(y - 1) * dw + x] : 0;
      if (!left && !up) {
        if (next >= MAX_LABELS) continue;
        label_scratch[y * dw + x] = next++;
      } else if (left && !up) {
        label_scratch[y * dw + x] = left;
      } else if (!left && up) {
        label_scratch[y * dw + x] = up;
      } else {
        label_scratch[y * dw + x] = left;
        unite(left, up);
      }
    }
  }

  for (int y = 0; y < dh; y++) {
    for (int x = 0; x < dw; x++) {
      uint16_t lab = label_scratch[y * dw + x];
      if (!lab) continue;
      lab = find(lab);
      label_scratch[y * dw + x] = lab;
      bw->area[lab]++;
      bw->sx[lab] += x;
      bw->sy[lab] += y;
      if (x < bw->minx[lab]) bw->minx[lab] = x;
      if (y < bw->miny[lab]) bw->miny[lab] = y;
      if (x > bw->maxx[lab]) bw->maxx[lab] = x;
      if (y > bw->maxy[lab]) bw->maxy[lab] = y;
    }
  }

  int count = 0;
  for (uint16_t lab = 1; lab < next && count < max_out; lab++) {
    if (find(lab) != lab) continue;
    if (bw->area[lab] < min_area) continue;
    esp32p4_blob_t &b = out[count++];
    b.area = bw->area[lab];
    b.cx = (int)(bw->sx[lab] / bw->area[lab]) + (cropped ? x0 : 0);
    b.cy = (int)(bw->sy[lab] / bw->area[lab]) + (cropped ? y0 : 0);
    b.box.x = bw->minx[lab] + (cropped ? x0 : 0);
    b.box.y = bw->miny[lab] + (cropped ? y0 : 0);
    b.box.w = bw->maxx[lab] - bw->minx[lab] + 1;
    b.box.h = bw->maxy[lab] - bw->miny[lab] + 1;
  }
  return count;
}

static void putPx(uint16_t *img, int w, int h, int x, int y, uint16_t color) {
  if (x < 0 || y < 0 || x >= w || y >= h) return;
  img[y * w + x] = color;
}

void ESP32P4_Cv::line(uint16_t *img, int w, int h, int x0, int y0, int x1, int y1, uint16_t color,
                      int thickness) {
  if (!img) return;
  int dx = abs(x1 - x0), sx = x0 < x1 ? 1 : -1;
  int dy = -abs(y1 - y0), sy = y0 < y1 ? 1 : -1;
  int err = dx + dy;
  for (;;) {
    for (int t = -thickness / 2; t <= thickness / 2; t++) {
      putPx(img, w, h, x0 + t, y0, color);
      putPx(img, w, h, x0, y0 + t, color);
    }
    if (x0 == x1 && y0 == y1) break;
    int e2 = 2 * err;
    if (e2 >= dy) {
      err += dy;
      x0 += sx;
    }
    if (e2 <= dx) {
      err += dx;
      y0 += sy;
    }
  }
}

