TheZeroHz/ESP32CSI_Vision/src/cv/ESP32P4_Cv.cpp
void ESP32P4_Cv::circle(uint16_t *img, int w, int h, int cx, int cy, int radius, uint16_t color,
                        int thickness) {
  if (!img || radius <= 0) return;
  for (int t = 0; t < thickness; t++) {
    int r = radius - t;
    if (r <= 0) break;
    int x = r, y = 0, err = 0;
    while (x >= y) {
      putPx(img, w, h, cx + x, cy + y, color);
      putPx(img, w, h, cx + y, cy + x, color);
      putPx(img, w, h, cx - y, cy + x, color);
      putPx(img, w, h, cx - x, cy + y, color);
      putPx(img, w, h, cx - x, cy - y, color);
      putPx(img, w, h, cx - y, cy - x, color);
      putPx(img, w, h, cx + y, cy - x, color);
      putPx(img, w, h, cx + x, cy - y, color);
      y++;
      err += 1 + 2 * y;
      if (2 * (err - x) + 1 > 0) {
        x--;
        err += 1 - 2 * x;
      }
    }
  }
}

// Tiny 5x7 font (ASCII 32..90 subset for digits/letters)
static const uint8_t FONT5X7[][5] = {
    {0x00, 0x00, 0x00, 0x00, 0x00},  // space
    {0x00, 0x00, 0x5F, 0x00, 0x00},  // !
    {0x3E, 0x51, 0x49, 0x45, 0x3E},  // 0
    {0x00, 0x42, 0x7F, 0x40, 0x00},  // 1
    {0x42, 0x61, 0x51, 0x49, 0x46},  // 2
    {0x21, 0x41, 0x45, 0x4B, 0x31},  // 3
    {0x18, 0x14, 0x12, 0x7F, 0x10},  // 4
    {0x27, 0x45, 0x45, 0x45, 0x39},  // 5
    {0x3C, 0x4A, 0x49, 0x49, 0x30},  // 6
    {0x01, 0x71, 0x09, 0x05, 0x03},  // 7
    {0x36, 0x49, 0x49, 0x49, 0x36},  // 8
    {0x06, 0x49, 0x49, 0x29, 0x1E},  // 9
};

static int fontIndex(char c) {
  if (c == ' ') return 0;
  if (c == '!') return 1;
  if (c >= '0' && c <= '9') return 2 + (c - '0');
  if (c >= 'a' && c <= 'z') c = (char)(c - 'a' + 'A');
  // Map A-Z to a simple pattern via digits fallback for unknown → space
  if (c >= 'A' && c <= 'Z') {
    // Minimal letter set: use bit patterns derived from ASCII index mod — keep readable digits mostly
    static const uint8_t LETTERS[26][5] = {
        {0x7E, 0x11, 0x11, 0x11, 0x7E}, {0x7F, 0x49, 0x49, 0x49, 0x36}, {0x3E, 0x41, 0x41, 0x41, 0x22},
        {0x7F, 0x41, 0x41, 0x22, 0x1C}, {0x7F, 0x49, 0x49, 0x49, 0x41}, {0x7F, 0x09, 0x09, 0x09, 0x01},
        {0x3E, 0x41, 0x49, 0x49, 0x7A}, {0x7F, 0x08, 0x08, 0x08, 0x7F}, {0x00, 0x41, 0x7F, 0x41, 0x00},
        {0x20, 0x40, 0x41, 0x3F, 0x01}, {0x7F, 0x08, 0x14, 0x22, 0x41}, {0x7F, 0x40, 0x40, 0x40, 0x40},
        {0x7F, 0x02, 0x0C, 0x02, 0x7F}, {0x7F, 0x04, 0x08, 0x10, 0x7F}, {0x3E, 0x41, 0x41, 0x41, 0x3E},
        {0x7F, 0x09, 0x09, 0x09, 0x06}, {0x3E, 0x41, 0x51, 0x21, 0x5E}, {0x7F, 0x09, 0x19, 0x29, 0x46},
        {0x46, 0x49, 0x49, 0x49, 0x31}, {0x01, 0x01, 0x7F, 0x01, 0x01}, {0x3F, 0x40, 0x40, 0x40, 0x3F},
        {0x1F, 0x20, 0x40, 0x20, 0x1F}, {0x3F, 0x40, 0x38, 0x40, 0x3F}, {0x63, 0x14, 0x08, 0x14, 0x63},
        {0x07, 0x08, 0x70, 0x08, 0x07}, {0x61, 0x51, 0x49, 0x45, 0x43},
    };
    (void)LETTERS;
    return -100 - (c - 'A');  // special
  }
  return 0;
}

void ESP32P4_Cv::putText(uint16_t *img, int w, int h, int x, int y, const char *text,
                         uint16_t color, int scale) {
  if (!img || !text || scale < 1) return;
  static const uint8_t LETTERS[26][5] = {
      {0x7E, 0x11, 0x11, 0x11, 0x7E}, {0x7F, 0x49, 0x49, 0x49, 0x36}, {0x3E, 0x41, 0x41, 0x41, 0x22},
      {0x7F, 0x41, 0x41, 0x22, 0x1C}, {0x7F, 0x49, 0x49, 0x49, 0x41}, {0x7F, 0x09, 0x09, 0x09, 0x01},
      {0x3E, 0x41, 0x49, 0x49, 0x7A}, {0x7F, 0x08, 0x08, 0x08, 0x7F}, {0x00, 0x41, 0x7F, 0x41, 0x00},
      {0x20, 0x40, 0x41, 0x3F, 0x01}, {0x7F, 0x08, 0x14, 0x22, 0x41}, {0x7F, 0x40, 0x40, 0x40, 0x40},
      {0x7F, 0x02, 0x0C, 0x02, 0x7F}, {0x7F, 0x04, 0x08, 0x10, 0x7F}, {0x3E, 0x41, 0x41, 0x41, 0x3E},
      {0x7F, 0x09, 0x09, 0x09, 0x06}, {0x3E, 0x41, 0x51, 0x21, 0x5E}, {0x7F, 0x09, 0x19, 0x29, 0x46},
      {0x46, 0x49, 0x49, 0x49, 0x31}, {0x01, 0x01, 0x7F, 0x01, 0x01}, {0x3F, 0x40, 0x40, 0x40, 0x3F},
      {0x1F, 0x20, 0x40, 0x20, 0x1F}, {0x3F, 0x40, 0x38, 0x40, 0x3F}, {0x63, 0x14, 0x08, 0x14, 0x63},
      {0x07, 0x08, 0x70, 0x08, 0x07}, {0x61, 0x51, 0x49, 0x45, 0x43},
  };
  int cx = x;
  for (const char *p = text; *p; p++) {
    char c = *p;
    const uint8_t *glyph = FONT5X7[0];
    int idx = fontIndex(c);
    if (idx >= 0 && idx < (int)(sizeof(FONT5X7) / sizeof(FONT5X7[0]))) glyph = FONT5X7[idx];
    else if (idx <= -100) glyph = LETTERS[(-100 - idx)];
    for (int col = 0; col < 5; col++) {
      uint8_t bits = glyph[col];
      for (int row = 0; row < 7; row++) {
        if (bits & (1 << row)) {
          for (int sy = 0; sy < scale; sy++)
            for (int sx = 0; sx < scale; sx++)
              putPx(img, w, h, cx + col * scale + sx, y + row * scale + sy, color);
        }
      }
    }
    cx += 6 * scale;
  }
}

void ESP32P4_Cv::drawBlob(uint16_t *img, int w, int h, const esp32p4_blob_t &b, uint16_t color,
                          int thickness) {
  ESP32P4_Img::fillRect565(img, w, h, b.box, color, thickness);
  circle(img, w, h, b.cx, b.cy, 4, color, 2);
}
